import { AttrKeys, MaterialType, WeaponDetailInfo } from "@/types";

/** 神射手之誓 */
export const metaData: WeaponDetailInfo = {
	desc: "据说曾属于技艺高强的射手，是一把上好的弓。因为散发出强烈的气息，难以用于狩猎。",
	attr: {
		atk: new Map([
			["1", 38.74],
			["20", 93.75],
			["40", 169.27],
			["50", 216.1],
			["60", 262.72],
			["70", 309.01],
			["80", 355.28],
			["90", 401.29],
			["20+", 113.25],
			["40+", 188.67],
			["50+", 235.6],
			["60+", 282.12],
			["70+", 328.51],
			["80+", 374.68]
		]),
		bonusKey: AttrKeys.cdmg,
		bonusData: new Map([
			["1", 10.2],
			["20", 18.02],
			["40", 26.26],
			["50", 30.39],
			["60", 34.51],
			["70", 38.62],
			["80", 42.74],
			["90", 46.86],
			["20+", 18.02],
			["40+", 26.26],
			["50+", 30.39],
			["60+", 34.51],
			["70+", 38.62],
			["80+", 42.74]
		])
	},
	materials: {
		[MaterialType.weapon]: "凛风奔狼的怀乡",
		[MaterialType.monster]: "地脉的新芽",
		[MaterialType.normal]: "史莱姆原浆"
	},
	affixData: {
		title: "精准",
		desc: "针对要害造成的伤害提升$[0]。",
		datas: {
			"0": [
				"24%",
				"30%",
				"36%",
				"42%",
				"48%"
			]
		}
	}
}