import { AttrKeys, MaterialType, WeaponDetailInfo } from "@/types";

/** 鹮穿之喙 */
export const metaData: WeaponDetailInfo = {
	desc: "以故事中的描述铸就的黄金之弓。若将它作为寻常武具使用，也可视为让纸上故事的一角在纸外的世界得到显现了吧。",
	attr: {
		atk: new Map([
			["1", 43.73],
			["20", 118.57],
			["40", 225.99],
			["50", 293.36],
			["60", 360.9],
			["70", 428.69],
			["80", 496.72],
			["90", 564.78],
			["20+", 144.47],
			["40+", 251.99],
			["50+", 319.26],
			["60+", 386.8],
			["70+", 454.69],
			["80+", 522.62]
		]),
		bonusKey: AttrKeys.atk + "Pct",
		bonusData: new Map([
			["1", 6],
			["20", 10.6],
			["40", 15.45],
			["50", 17.87],
			["60", 20.3],
			["70", 22.72],
			["80", 25.14],
			["90", 27.56],
			["20+", 10.6],
			["40+", 15.45],
			["50+", 17.87],
			["60+", 20.3],
			["70+", 22.72],
			["80+", 25.14]
		])
	},
	materials: {
		[MaterialType.weapon]: "谧林涓露的金符",
		[MaterialType.monster]: "漫游者的盛放之花",
		[MaterialType.normal]: "织金红绸"
	},
	affixData: {
		title: "秘智之眸的青睐",
		desc: "重击命中敌人后的6秒内，角色元素精通提升$[0]点。该效果至多叠加2层，每0.5秒至多触发一次。",
		datas: {
			"0": [
				"40",
				"50",
				"60",
				"70",
				"80"
			]
		}
	}
}