import { AttrKeys, MaterialType, WeaponDetailInfo } from "@/types";

/** 曚云之月 */
export const metaData: WeaponDetailInfo = {
	desc: "出自螺钿与珊瑚的精美战弓，月色的弓臂上流动着凄然的光彩。",
	attr: {
		atk: new Map([
			["1", 43.73],
			["20", 118.57],
			["40", 225.99],
			["50", 293.36],
			["60", 360.9],
			["70", 428.69],
			["80", 496.72],
			["90", 564.78],
			["20+", 144.47],
			["40+", 251.99],
			["50+", 319.26],
			["60+", 386.8],
			["70+", 454.69],
			["80+", 522.62]
		]),
		bonusKey: AttrKeys.atk + "Pct",
		bonusData: new Map([
			["1", 6],
			["20", 10.6],
			["40", 15.45],
			["50", 17.87],
			["60", 20.3],
			["70", 22.72],
			["80", 25.14],
			["90", 27.56],
			["20+", 10.6],
			["40+", 15.45],
			["50+", 17.87],
			["60+", 20.3],
			["70+", 22.72],
			["80+", 25.14]
		])
	},
	materials: {
		[MaterialType.weapon]: "鸣神御灵的勇武",
		[MaterialType.monster]: "偏光棱镜",
		[MaterialType.normal]: "浮游晶化核"
	},
	affixData: {
		title: "驭浪的海祇民",
		desc: "队伍中所有角色的元素能量上限的总和，每1点能使装备此武器的角色的元素爆发造成的伤害提高$[0]，通过这种方式，元素爆发造成的伤害至多提高$[1]。",
		datas: {
			"0": [
				"0.12%",
				"0.15%",
				"0.18%",
				"0.21%",
				"0.24%"
			],
		"1": [
				"40%",
				"50%",
				"60%",
				"70%",
				"80%"
			]
		}
	}
}