import { AttrKeys, MaterialType, WeaponDetailInfo } from "@/types";

/** 筑云 */
export const metaData: WeaponDetailInfo = {
	desc: "解析昔日拱卫天衡的仙家机关后，由玉衡星委托黑岩厂锻造的实验型制式兵器。",
	attr: {
		atk: new Map([
			["1", 42.4],
			["20", 108.93],
			["40", 204.83],
			["50", 265.86],
			["60", 326.78],
			["70", 387.66],
			["80", 448.68],
			["90", 509.61],
			["20+", 134.83],
			["40+", 230.83],
			["50+", 291.76],
			["60+", 352.68],
			["70+", 413.66],
			["80+", 474.58]
		]),
		bonusKey: AttrKeys.mastery,
		bonusData: new Map([
			["1", 36],
			["20", 63.61],
			["40", 92.7],
			["50", 107.24],
			["60", 121.79],
			["70", 136.3],
			["80", 150.84],
			["90", 165.38],
			["20+", 63.61],
			["40+", 92.7],
			["50+", 107.24],
			["60+", 121.79],
			["70+", 136.3],
			["80+", 150.84]
		])
	},
	materials: {
		[MaterialType.weapon]: "漆黑陨铁的一块",
		[MaterialType.monster]: "未熄的剑柄",
		[MaterialType.normal]: "尉官的徽记"
	},
	affixData: {
		title: "镌岩为坊",
		desc: "元素能量减少后，装备者的元素精通提升$[0]点。该效果持续18秒，至多叠加2层。",
		datas: {
			"0": [
				"40",
				"50",
				"60",
				"70",
				"80"
			]
		}
	}
}