import { AttrKeys, MaterialType, WeaponDetailInfo } from "@/types";

/** 猎人之径 */
export const metaData: WeaponDetailInfo = {
	desc: "以珍贵的白枝制成的饰金猎弓，曾经射落无数侵入森林的恶兽。",
	attr: {
		atk: new Map([
			["1", 44.34],
			["20", 110.17],
			["40", 209.82],
			["50", 275.46],
			["60", 341.46],
			["70", 407.81],
			["80", 474.55],
			["90", 541.83],
			["20+", 141.27],
			["40+", 240.92],
			["50+", 306.66],
			["60+", 372.56],
			["70+", 438.91],
			["80+", 505.65]
		]),
		bonusKey: AttrKeys.cpct,
		bonusData: new Map([
			["1", 9.6],
			["20", 16.96],
			["40", 24.72],
			["50", 28.6],
			["60", 32.48],
			["70", 36.35],
			["80", 40.22],
			["90", 44.1],
			["20+", 16.96],
			["40+", 24.72],
			["50+", 28.6],
			["60+", 32.48],
			["70+", 36.35],
			["80+", 40.22]
		])
	},
	materials: {
		[MaterialType.weapon]: "烈日威权的旧日",
		[MaterialType.monster]: "茁壮菌核",
		[MaterialType.normal]: "织金红绸"
	},
	affixData: {
		title: "兽径的终点",
		desc: "获得$[0]所有元素伤害加成。重击命中敌人后，将获得「无休止的狩猎」：重击造成的伤害值提高，提高值相当于元素精通数值的$[1]。该效果将在生效12次或10秒后消失，每12秒至多获得一次无休止的狩猎。",
		datas: {
			"0": [
				"12%",
				"15%",
				"18%",
				"21%",
				"24%"
			],
		"1": [
				"160%",
				"200%",
				"240%",
				"280%",
				"320%"
			]
		}
	}
}