import { AttrKeys, MaterialType, WeaponDetailInfo } from "@/types";

/** 试作星镰 */
export const metaData: WeaponDetailInfo = {
	desc: "黑岩厂中秘藏的古老钩枪。锋芒上点点的闪光有如夜空稀星。",
	attr: {
		atk: new Map([
			["1", 42.4],
			["20", 108.93],
			["40", 204.83],
			["50", 265.86],
			["60", 326.78],
			["70", 387.66],
			["80", 448.68],
			["90", 509.61],
			["20+", 134.83],
			["40+", 230.83],
			["50+", 291.76],
			["60+", 352.68],
			["70+", 413.66],
			["80+", 474.58]
		]),
		bonusKey: AttrKeys.recharge,
		bonusData: new Map([
			["1", 10],
			["20", 17.67],
			["40", 25.75],
			["50", 29.79],
			["60", 33.83],
			["70", 37.86],
			["80", 41.9],
			["90", 45.94],
			["20+", 17.67],
			["40+", 25.75],
			["50+", 29.79],
			["60+", 33.83],
			["70+", 37.86],
			["80+", 41.9]
		])
	},
	materials: {
		[MaterialType.weapon]: "漆黑陨铁的一块",
		[MaterialType.monster]: "石化的骨片",
		[MaterialType.normal]: "不祥的面具"
	},
	affixData: {
		title: "嗜魔",
		desc: "施放元素战技后，普通攻击和重击造成的伤害提高$[0]。该效果持续12秒，最多叠加2层。",
		datas: {
			"0": [
				"8%",
				"10%",
				"12%",
				"14%",
				"16%"
			]
		}
	}
}