import { AttrKeys, MaterialType, WeaponDetailInfo } from "@/types";

/** 「渔获」 */
export const metaData: WeaponDetailInfo = {
	desc: "在久远的过去，曾经闻名稻妻的大盗爱用的枪。",
	attr: {
		atk: new Map([
			["1", 42.4],
			["20", 108.93],
			["40", 204.83],
			["50", 265.86],
			["60", 326.78],
			["70", 387.66],
			["80", 448.68],
			["90", 509.61],
			["20+", 134.83],
			["40+", 230.83],
			["50+", 291.76],
			["60+", 352.68],
			["70+", 413.66],
			["80+", 474.58]
		]),
		bonusKey: AttrKeys.recharge,
		bonusData: new Map([
			["1", 10],
			["20", 17.67],
			["40", 25.75],
			["50", 29.79],
			["60", 33.83],
			["70", 37.86],
			["80", 41.9],
			["90", 45.94],
			["20+", 17.67],
			["40+", 25.75],
			["50+", 29.79],
			["60+", 33.83],
			["70+", 37.86],
			["80+", 41.9]
		])
	},
	materials: {
		[MaterialType.weapon]: "今昔剧画之鬼人",
		[MaterialType.monster]: "混沌真眼",
		[MaterialType.normal]: "浮游晶化核"
	},
	affixData: {
		title: "船歌",
		desc: "元素爆发造成的伤害提升$[0]，元素爆发的暴击率提升$[1]。",
		datas: {
			"0": [
				"16%",
				"20%",
				"24%",
				"28%",
				"32%"
			],
		"1": [
				"6%",
				"7.5%",
				"9%",
				"10.5%",
				"12%"
			]
		}
	}
}