import { AttrKeys, MaterialType, WeaponDetailInfo } from "@/types";

/** 风信之锋 */
export const metaData: WeaponDetailInfo = {
	desc: "导示长风的标鹄。风的牧歌并不总是轻柔如初…",
	attr: {
		atk: new Map([
			["1", 42.4],
			["20", 108.93],
			["40", 204.83],
			["50", 265.86],
			["60", 326.78],
			["70", 387.66],
			["80", 448.68],
			["90", 509.61],
			["20+", 134.83],
			["40+", 230.83],
			["50+", 291.76],
			["60+", 352.68],
			["70+", 413.66],
			["80+", 474.58]
		]),
		bonusKey: AttrKeys.atk + "Pct",
		bonusData: new Map([
			["1", 9],
			["20", 15.9],
			["40", 23.18],
			["50", 26.81],
			["60", 30.45],
			["70", 34.07],
			["80", 37.71],
			["90", 41.35],
			["20+", 15.9],
			["40+", 23.18],
			["50+", 26.81],
			["60+", 30.45],
			["70+", 34.07],
			["80+", 37.71]
		])
	},
	materials: {
		[MaterialType.weapon]: "凛风奔狼的怀乡",
		[MaterialType.monster]: "幽邃刻像",
		[MaterialType.normal]: "史莱姆原浆"
	},
	affixData: {
		title: "不至之风",
		desc: "触发元素反应后的10秒内，攻击力提升$[0]，元素精通提升$[1]点。",
		datas: {
			"0": [
				"12%",
				"15%",
				"18%",
				"21%",
				"24%"
			],
		"1": [
				"48",
				"60",
				"72",
				"84",
				"96"
			]
		}
	}
}