import { AttrKeys, MaterialType, WeaponDetailInfo } from "@/types";

/** 峡湾长歌 */
export const metaData: WeaponDetailInfo = {
	desc: "队伍中存在至少三种不同元素类型的角色时，元素精通提升120点。",
	attr: {
		atk: new Map([
			["1", 42.4],
			["20", 108.93],
			["40", 204.83],
			["50", 265.86],
			["60", 326.78],
			["70", 387.66],
			["80", 448.68],
			["90", 509.61],
			["20+", 134.83],
			["40+", 230.83],
			["50+", 291.76],
			["60+", 352.68],
			["70+", 413.66],
			["80+", 474.58]
		]),
		bonusKey: AttrKeys.cpct,
		bonusData: new Map([
			["1", 6],
			["20", 10.6],
			["40", 15.45],
			["50", 17.87],
			["60", 20.3],
			["70", 22.72],
			["80", 25.14],
			["90", 27.56],
			["20+", 10.6],
			["40+", 15.45],
			["50+", 17.87],
			["60+", 20.3],
			["70+", 22.72],
			["80+", 25.14]
		])
	},
	materials: {
		[MaterialType.weapon]: "无垢之海的金杯",
		[MaterialType.monster]: "漫游者的盛放之花",
		[MaterialType.normal]: "原素花蜜"
	},
	affixData: {
		title: "冰原的诸多故事",
		desc: "队伍中存在至少三种不同元素类型的角色时，元素精通提升$[0]点。",
		datas: {
			"0": [
				"120",
				"150",
				"180",
				"210",
				"240"
			]
		}
	}
}