import { AttrKeys, MaterialType, WeaponDetailInfo } from "@/types";

/** 赤沙之杖 */
export const metaData: WeaponDetailInfo = {
	desc: "黑曜石塑造的一对的权杖中的一件。在传说中，具有引领沙之民的权威，但如今已经没有能辨别出这件王器形象的臣子了。",
	attr: {
		atk: new Map([
			["1", 44.34],
			["20", 110.17],
			["40", 209.82],
			["50", 275.46],
			["60", 341.46],
			["70", 407.81],
			["80", 474.55],
			["90", 541.83],
			["20+", 141.27],
			["40+", 240.92],
			["50+", 306.66],
			["60+", 372.56],
			["70+", 438.91],
			["80+", 505.65]
		]),
		bonusKey: AttrKeys.cpct,
		bonusData: new Map([
			["1", 9.6],
			["20", 16.96],
			["40", 24.72],
			["50", 28.6],
			["60", 32.48],
			["70", 36.35],
			["80", 40.22],
			["90", 44.1],
			["20+", 16.96],
			["40+", 24.72],
			["50+", 28.6],
			["60+", 32.48],
			["70+", 36.35],
			["80+", 40.22]
		])
	},
	materials: {
		[MaterialType.weapon]: "绿洲花园的真谛",
		[MaterialType.monster]: "混沌锚栓",
		[MaterialType.normal]: "孢囊晶尘"
	},
	affixData: {
		title: "蜃气尽头的热梦",
		desc: "基于装备者元素精通的$[0]，获得攻击力加成。元素战技命中敌人时，将产生持续10秒的「赤沙之梦」效果：基于装备者元素精通的$[1]，获得攻击力加成，该效果至多叠加3层。",
		datas: {
			"0": [
				"52%",
				"65%",
				"78%",
				"91%",
				"104%"
			],
		"1": [
				"28%",
				"35%",
				"42%",
				"49%",
				"56%"
			]
		}
	}
}