import { AttrKeys, MaterialType, WeaponDetailInfo } from "@/types";

/** 飞天御剑 */
export const metaData: WeaponDetailInfo = {
	desc: "可靠的钢剑，传说著名的「御剑公子」曾试图借助它飞天。",
	attr: {
		atk: new Map([
			["1", 37.61],
			["20", 85.56],
			["40", 151.28],
			["50", 192.71],
			["60", 233.69],
			["70", 274.19],
			["80", 314.45],
			["90", 354.38],
			["20+", 105.06],
			["40+", 170.68],
			["50+", 212.21],
			["60+", 253.09],
			["70+", 293.69],
			["80+", 333.85]
		]),
		bonusKey: AttrKeys.recharge,
		bonusData: new Map([
			["1", 11.33],
			["20", 20.03],
			["40", 29.18],
			["50", 33.76],
			["60", 38.34],
			["70", 42.91],
			["80", 47.49],
			["90", 52.07],
			["20+", 20.03],
			["40+", 29.18],
			["50+", 33.76],
			["60+", 38.34],
			["70+", 42.91],
			["80+", 47.49]
		])
	},
	materials: {
		[MaterialType.weapon]: "漆黑陨铁的一块",
		[MaterialType.monster]: "石化的骨片",
		[MaterialType.normal]: "尉官的徽记"
	},
	affixData: {
		title: "决心",
		desc: "施放元素爆发后，提高$[0]攻击力和移动速度，持续15秒。",
		datas: {
			"0": [
				"12%",
				"15%",
				"18%",
				"21%",
				"24%"
			]
		}
	}
}