import { AttrKeys, MaterialType, WeaponDetailInfo } from "@/types";

/** 黎明神剑 */
export const metaData: WeaponDetailInfo = {
	desc: "一把曾经耀若朝阳的宝剑，掌握它的人会获得「自我感觉良好」的力量加持。剑身上的发光材料已经褪去。",
	attr: {
		atk: new Map([
			["1", 38.74],
			["20", 93.75],
			["40", 169.27],
			["50", 216.1],
			["60", 262.72],
			["70", 309.01],
			["80", 355.28],
			["90", 401.29],
			["20+", 113.25],
			["40+", 188.67],
			["50+", 235.6],
			["60+", 282.12],
			["70+", 328.51],
			["80+", 374.68]
		]),
		bonusKey: AttrKeys.cdmg,
		bonusData: new Map([
			["1", 10.2],
			["20", 18.02],
			["40", 26.26],
			["50", 30.39],
			["60", 34.51],
			["70", 38.62],
			["80", 42.74],
			["90", 46.86],
			["20+", 18.02],
			["40+", 26.26],
			["50+", 30.39],
			["60+", 34.51],
			["70+", 38.62],
			["80+", 42.74]
		])
	},
	materials: {
		[MaterialType.weapon]: "凛风奔狼的怀乡",
		[MaterialType.monster]: "地脉的新芽",
		[MaterialType.normal]: "史莱姆原浆"
	},
	affixData: {
		title: "激励",
		desc: "生命值高于90%时，暴击率提升$[0]。",
		datas: {
			"0": [
				"14%",
				"17.5%",
				"21%",
				"24.5%",
				"28%"
			]
		}
	}
}