import { AttrKeys, MaterialType, WeaponDetailInfo } from "@/types";

/** 试作斩岩 */
export const metaData: WeaponDetailInfo = {
	desc: "黑岩厂中秘藏的古老长剑。可挥砍断岩而刃不卷。",
	attr: {
		atk: new Map([
			["1", 43.73],
			["20", 118.57],
			["40", 225.99],
			["50", 293.36],
			["60", 360.9],
			["70", 428.69],
			["80", 496.72],
			["90", 564.78],
			["20+", 144.47],
			["40+", 251.99],
			["50+", 319.26],
			["60+", 386.8],
			["70+", 454.69],
			["80+", 522.62]
		]),
		bonusKey: AttrKeys.phy,
		bonusData: new Map([
			["1", 7.51],
			["20", 13.26],
			["40", 19.33],
			["50", 22.36],
			["60", 25.4],
			["70", 28.42],
			["80", 31.45],
			["90", 34.49],
			["20+", 13.26],
			["40+", 19.33],
			["50+", 22.36],
			["60+", 25.4],
			["70+", 28.42],
			["80+", 31.45]
		])
	},
	materials: {
		[MaterialType.weapon]: "雾海云间的转还",
		[MaterialType.monster]: "雾虚灯芯",
		[MaterialType.normal]: "尉官的徽记"
	},
	affixData: {
		title: "碎石",
		desc: "普通攻击或重击命中时，攻击力和防御力提高$[0]，持续6秒，最多叠加4层。该效果每0.3秒只能触发一次。",
		datas: {
			"0": [
				"4%",
				"5%",
				"6%",
				"7%",
				"8%"
			]
		}
	}
}