import { AttrKeys, MaterialType, WeaponDetailInfo } from "@/types";

/** 降临之剑 */
export const metaData: WeaponDetailInfo = {
	desc: "造型独特的剑。看起来并不属于这个世界。",
	attr: {
		atk: new Map([
			["1", 38.74],
			["20", 93.75],
			["40", 175.67],
			["50", 229.1],
			["60", 282.12],
			["70", 334.91],
			["80", 387.68],
			["90", 440.19],
			["20+", 119.65],
			["40+", 201.67],
			["50+", 255],
			["60+", 308.02],
			["70+", 360.91],
			["80+", 413.58]
		]),
		bonusKey: AttrKeys.atk + "Pct",
		bonusData: new Map([
			["1", 7.66],
			["20", 13.54],
			["40", 19.72],
			["50", 22.82],
			["60", 25.91],
			["70", 29],
			["80", 32.1],
			["90", 35.19],
			["20+", 13.54],
			["40+", 19.72],
			["50+", 22.82],
			["60+", 25.91],
			["70+", 29],
			["80+", 32.1]
		])
	},
	materials: {
		[MaterialType.weapon]: "凛风奔狼的怀乡",
		[MaterialType.monster]: "地脉的新芽",
		[MaterialType.normal]: "攫金鸦印"
	},
	affixData: {
		title: "降世",
		desc: "仅在以下平台生效：\n“PlayStation Network”\n普通攻击与重击命中敌人后有50%概率在小范围内造成200%攻击力的伤害。该效果每10秒只能触发一次；此外，旅行者装备降临之剑时，攻击力提升66点。",
		datas: {
			
		}
	}
}