import { AttrKeys, MaterialType, WeaponDetailInfo } from "@/types";

/** 腐殖之剑 */
export const metaData: WeaponDetailInfo = {
	desc: "希冀着生命的诡谲直剑，附有连龙也能侵蚀的腐殖之毒。",
	attr: {
		atk: new Map([
			["1", 42.4],
			["20", 108.93],
			["40", 204.83],
			["50", 265.86],
			["60", 326.78],
			["70", 387.66],
			["80", 448.68],
			["90", 509.61],
			["20+", 134.83],
			["40+", 230.83],
			["50+", 291.76],
			["60+", 352.68],
			["70+", 413.66],
			["80+", 474.58]
		]),
		bonusKey: AttrKeys.recharge,
		bonusData: new Map([
			["1", 10],
			["20", 17.67],
			["40", 25.75],
			["50", 29.79],
			["60", 33.83],
			["70", 37.86],
			["80", 41.9],
			["90", 45.94],
			["20+", 17.67],
			["40+", 25.75],
			["50+", 29.79],
			["60+", 33.83],
			["70+", 37.86],
			["80+", 41.9]
		])
	},
	materials: {
		[MaterialType.weapon]: "狮牙斗士的理想",
		[MaterialType.monster]: "黑晶号角",
		[MaterialType.normal]: "尉官的徽记"
	},
	affixData: {
		title: "无尽的渴慕",
		desc: "元素战技造成的伤害增加$[0]，元素战技的暴击率提升$[1]。",
		datas: {
			"0": [
				"16%",
				"20%",
				"24%",
				"28%",
				"32%"
			],
		"1": [
				"6%",
				"7.5%",
				"9%",
				"10.5%",
				"12%"
			]
		}
	}
}