import { AttrKeys, MaterialType, WeaponDetailInfo } from "@/types";

/** 黑岩斩刀 */
export const metaData: WeaponDetailInfo = {
	desc: "坚韧无比的黑岩大刀，通体皆为玄赤之色。",
	attr: {
		atk: new Map([
			["1", 42.4],
			["20", 108.93],
			["40", 204.83],
			["50", 265.86],
			["60", 326.78],
			["70", 387.66],
			["80", 448.68],
			["90", 509.61],
			["20+", 134.83],
			["40+", 230.83],
			["50+", 291.76],
			["60+", 352.68],
			["70+", 413.66],
			["80+", 474.58]
		]),
		bonusKey: AttrKeys.cdmg,
		bonusData: new Map([
			["1", 12],
			["20", 21.2],
			["40", 30.9],
			["50", 35.75],
			["60", 40.6],
			["70", 45.43],
			["80", 50.28],
			["90", 55.13],
			["20+", 21.2],
			["40+", 30.9],
			["50+", 35.75],
			["60+", 40.6],
			["70+", 45.43],
			["80+", 50.28]
		])
	},
	materials: {
		[MaterialType.weapon]: "雾海云间的转还",
		[MaterialType.monster]: "雾虚灯芯",
		[MaterialType.normal]: "尉官的徽记"
	},
	affixData: {
		title: "乘胜追击",
		desc: "击败敌人后，攻击力提升$[0]，持续30秒。该效果至多叠加3层，每层持续时间独立。",
		datas: {
			"0": [
				"12%",
				"15%",
				"18%",
				"21%",
				"24%"
			]
		}
	}
}