import { AttrKeys, MaterialType, WeaponDetailInfo } from "@/types";

/** 螭骨剑 */
export const metaData: WeaponDetailInfo = {
	desc: "来自古代大海的稀有兵器，舞剑猎猎宛如太古的涛声。",
	attr: {
		atk: new Map([
			["1", 42.4],
			["20", 108.93],
			["40", 204.83],
			["50", 265.86],
			["60", 326.78],
			["70", 387.66],
			["80", 448.68],
			["90", 509.61],
			["20+", 134.83],
			["40+", 230.83],
			["50+", 291.76],
			["60+", 352.68],
			["70+", 413.66],
			["80+", 474.58]
		]),
		bonusKey: AttrKeys.cpct,
		bonusData: new Map([
			["1", 6],
			["20", 10.6],
			["40", 15.45],
			["50", 17.87],
			["60", 20.3],
			["70", 22.72],
			["80", 25.14],
			["90", 27.56],
			["20+", 10.6],
			["40+", 15.45],
			["50+", 17.87],
			["60+", 20.3],
			["70+", 22.72],
			["80+", 25.14]
		])
	},
	materials: {
		[MaterialType.weapon]: "漆黑陨铁的一块",
		[MaterialType.monster]: "石化的骨片",
		[MaterialType.normal]: "原素花蜜"
	},
	affixData: {
		title: "破浪",
		desc: "角色在场上时，每4秒提升$[0]造成的伤害，$[1]受到的伤害。该效果最多叠加5层，不随角色退场重置，受到伤害后会减少1层效果。",
		datas: {
			"0": [
				"6%",
				"7%",
				"8%",
				"9%",
				"10%"
			],
		"1": [
				"3%",
				"2.7%",
				"2.4%",
				"2.2%",
				"2%"
			]
		}
	}
}