import { AttrKeys, MaterialType, WeaponDetailInfo } from "@/types";

/** 饰铁之花 */
export const metaData: WeaponDetailInfo = {
	desc: "造型优雅利落的大剑，其上装饰节庆的鲜花与缎带。",
	attr: {
		atk: new Map([
			["1", 43.73],
			["20", 118.57],
			["40", 225.99],
			["50", 293.36],
			["60", 360.9],
			["70", 428.69],
			["80", 496.72],
			["90", 564.78],
			["20+", 144.47],
			["40+", 251.99],
			["50+", 319.26],
			["60+", 386.8],
			["70+", 454.69],
			["80+", 522.62]
		]),
		bonusKey: AttrKeys.mastery,
		bonusData: new Map([
			["1", 24],
			["20", 42.41],
			["40", 61.8],
			["50", 71.5],
			["60", 81.19],
			["70", 90.86],
			["80", 100.56],
			["90", 110.26],
			["20+", 42.41],
			["40+", 61.8],
			["50+", 71.5],
			["60+", 81.19],
			["70+", 90.86],
			["80+", 100.56]
		])
	},
	materials: {
		[MaterialType.weapon]: "狮牙斗士的理想",
		[MaterialType.monster]: "锲纹的横脊",
		[MaterialType.normal]: "浮游晶化核"
	},
	affixData: {
		title: "风与花的密语",
		desc: "元素战技命中敌人或触发元素反应后的8秒内，攻击力提升$[0]，元素精通提升$[1]点。",
		datas: {
			"0": [
				"12%",
				"15%",
				"18%",
				"21%",
				"24%"
			],
		"1": [
				"48",
				"60",
				"72",
				"84",
				"96"
			]
		}
	}
}