import { AttrKeys, MaterialType, WeaponDetailInfo } from "@/types";

/** 恶王丸 */
export const metaData: WeaponDetailInfo = {
	desc: "传说中「恶王」的爱刀，刀身庞大雄伟，但挥舞起来却出乎意料地轻便。",
	attr: {
		atk: new Map([
			["1", 42.4],
			["20", 108.93],
			["40", 204.83],
			["50", 265.86],
			["60", 326.78],
			["70", 387.66],
			["80", 448.68],
			["90", 509.61],
			["20+", 134.83],
			["40+", 230.83],
			["50+", 291.76],
			["60+", 352.68],
			["70+", 413.66],
			["80+", 474.58]
		]),
		bonusKey: AttrKeys.atk + "Pct",
		bonusData: new Map([
			["1", 9],
			["20", 15.9],
			["40", 23.18],
			["50", 26.81],
			["60", 30.45],
			["70", 34.07],
			["80", 37.71],
			["90", 41.35],
			["20+", 15.9],
			["40+", 23.18],
			["50+", 26.81],
			["60+", 30.45],
			["70+", 34.07],
			["80+", 37.71]
		])
	},
	materials: {
		[MaterialType.weapon]: "远海夷地的金枝",
		[MaterialType.monster]: "隐兽鬼爪",
		[MaterialType.normal]: "名刀镡"
	},
	affixData: {
		title: "驭浪的海祇民",
		desc: "队伍中所有角色的元素能量上限的总和，每1点能使装备此武器的角色的元素爆发造成的伤害提高$[0]，通过这种方式，元素爆发造成的伤害至多提高$[1]。",
		datas: {
			"0": [
				"0.12%",
				"0.15%",
				"0.18%",
				"0.21%",
				"0.24%"
			],
		"1": [
				"40%",
				"50%",
				"60%",
				"70%",
				"80%"
			]
		}
	}
}