import { AttrKeys, MaterialType, WeaponDetailInfo } from "@/types";

/** 试作金珀 */
export const metaData: WeaponDetailInfo = {
	desc: "黑岩厂中秘藏的金珀法器。其中黯黯绽放着日月星光。",
	attr: {
		atk: new Map([
			["1", 42.4],
			["20", 108.93],
			["40", 204.83],
			["50", 265.86],
			["60", 326.78],
			["70", 387.66],
			["80", 448.68],
			["90", 509.61],
			["20+", 134.83],
			["40+", 230.83],
			["50+", 291.76],
			["60+", 352.68],
			["70+", 413.66],
			["80+", 474.58]
		]),
		bonusKey: AttrKeys.hp + "Pct",
		bonusData: new Map([
			["1", 9],
			["20", 15.9],
			["40", 23.18],
			["50", 26.81],
			["60", 30.45],
			["70", 34.07],
			["80", 37.71],
			["90", 41.35],
			["20+", 15.9],
			["40+", 23.18],
			["50+", 26.81],
			["60+", 30.45],
			["70+", 34.07],
			["80+", 37.71]
		])
	},
	materials: {
		[MaterialType.weapon]: "雾海云间的转还",
		[MaterialType.monster]: "雾虚灯芯",
		[MaterialType.normal]: "历战的箭簇"
	},
	affixData: {
		title: "炊金",
		desc: "施放元素爆发后6秒内，每2秒恢复$[0]点元素能量，队伍中的所有角色每2秒恢复$[1]生命值。",
		datas: {
			"0": [
				"4",
				"4.5",
				"5",
				"5.5",
				"6"
			],
		"1": [
				"4%",
				"4.5%",
				"5%",
				"5.5%",
				"6%"
			]
		}
	}
}