import { AttrKeys, MaterialType, WeaponDetailInfo } from "@/types";

/** 暗巷的酒与诗 */
export const metaData: WeaponDetailInfo = {
	desc: "过去贵族时代流行的歌谱，作者已无从考究。其中记载了某位侠盗的故事…",
	attr: {
		atk: new Map([
			["1", 43.73],
			["20", 118.57],
			["40", 225.99],
			["50", 293.36],
			["60", 360.9],
			["70", 428.69],
			["80", 496.72],
			["90", 564.78],
			["20+", 144.47],
			["40+", 251.99],
			["50+", 319.26],
			["60+", 386.8],
			["70+", 454.69],
			["80+", 522.62]
		]),
		bonusKey: AttrKeys.recharge,
		bonusData: new Map([
			["1", 6.67],
			["20", 11.78],
			["40", 17.17],
			["50", 19.86],
			["60", 22.55],
			["70", 25.24],
			["80", 27.93],
			["90", 30.63],
			["20+", 11.78],
			["40+", 17.17],
			["50+", 19.86],
			["60+", 22.55],
			["70+", 25.24],
			["80+", 27.93]
		])
	},
	materials: {
		[MaterialType.weapon]: "凛风奔狼的怀乡",
		[MaterialType.monster]: "地脉的新芽",
		[MaterialType.normal]: "攫金鸦印"
	},
	affixData: {
		title: "变化万端",
		desc: "普通攻击命中敌人后，冲刺或替代冲刺的能力消耗的体力降低$[0]，持续5秒。此外，使用冲刺或替代冲刺的能力后，攻击力提升$[1]，持续5秒。",
		datas: {
			"0": [
				"14%",
				"16%",
				"18%",
				"20%",
				"22%"
			],
		"1": [
				"20%",
				"25%",
				"30%",
				"35%",
				"40%"
			]
		}
	}
}