import { AttrKeys, MaterialType, WeaponDetailInfo } from "@/types";

/** 天空之卷 */
export const metaData: WeaponDetailInfo = {
	desc: "象征风龙与其主风之神的云图集。细致记载了北地天空的风与云，蕴含苍空与长风的力量。",
	attr: {
		atk: new Map([
			["1", 47.54],
			["20", 133.29],
			["40", 260.56],
			["50", 341.43],
			["60", 423.4],
			["70", 506.22],
			["80", 589.85],
			["90", 674.33],
			["20+", 164.39],
			["40+", 291.66],
			["50+", 372.63],
			["60+", 454.5],
			["70+", 537.32],
			["80+", 620.95]
		]),
		bonusKey: AttrKeys.atk + "Pct",
		bonusData: new Map([
			["1", 7.2],
			["20", 12.72],
			["40", 18.54],
			["50", 21.45],
			["60", 24.36],
			["70", 27.26],
			["80", 30.17],
			["90", 33.08],
			["20+", 12.72],
			["40+", 18.54],
			["50+", 21.45],
			["60+", 24.36],
			["70+", 27.26],
			["80+", 30.17]
		])
	},
	materials: {
		[MaterialType.weapon]: "凛风奔狼的怀乡",
		[MaterialType.monster]: "地脉的新芽",
		[MaterialType.normal]: "历战的箭簇"
	},
	affixData: {
		title: "浮游四方的灵云",
		desc: "元素伤害加成提升$[0]；普通攻击命中时，有50%的概率获得高天流云的青睐，在15秒内主动攻击附近的敌人，造成等同于$[1]攻击力的伤害。该效果每30秒只能触发一次。",
		datas: {
			"0": [
				"12%",
				"15%",
				"18%",
				"21%",
				"24%"
			],
		"1": [
				"160%",
				"200%",
				"240%",
				"280%",
				"320%"
			]
		}
	}
}