import { AttrKeys, MaterialType, WeaponDetailInfo } from "@/types";

/** 金流监督 */
export const metaData: WeaponDetailInfo = {
	desc: "能够监控特定现象的悬浮仪器，废弃后被拾获者重新改造为其它用途。",
	attr: {
		atk: new Map([
			["1", 47.54],
			["20", 133.29],
			["40", 260.56],
			["50", 341.43],
			["60", 423.4],
			["70", 506.22],
			["80", 589.85],
			["90", 674.33],
			["20+", 164.39],
			["40+", 291.66],
			["50+", 372.63],
			["60+", 454.5],
			["70+", 537.32],
			["80+", 620.95]
		]),
		bonusKey: AttrKeys.cpct,
		bonusData: new Map([
			["1", 4.8],
			["20", 8.48],
			["40", 12.36],
			["50", 14.3],
			["60", 16.24],
			["70", 18.17],
			["80", 20.11],
			["90", 22.05],
			["20+", 8.48],
			["40+", 12.36],
			["50+", 14.3],
			["60+", 16.24],
			["70+", 18.17],
			["80+", 20.11]
		])
	},
	materials: {
		[MaterialType.weapon]: "无垢之海的金杯",
		[MaterialType.monster]: "役人的时时刻刻",
		[MaterialType.normal]: "异色结晶石"
	},
	affixData: {
		title: "黄金的血潮",
		desc: "攻击力提升$[0]。当前生命值提升或降低时，普通攻击造成的伤害提升$[1]，重击造成的伤害提升$[2]。该效果持续4秒，至多叠加3层，每0.3秒至多触发一次；处于叠加3层的状态下时，攻击速度提升$[3]。",
		datas: {
			"0": [
				"16%",
				"20%",
				"24%",
				"28%",
				"32%"
			],
		"1": [
				"16%",
				"20%",
				"24%",
				"28%",
				"32%"
			],
		"2": [
				"14%",
				"17.5%",
				"21%",
				"24.5%",
				"28%"
			],
		"3": [
				"8%",
				"10%",
				"12%",
				"14%",
				"16%"
			]
		}
	}
}