import { AttrKeys, MaterialType, WeaponDetailInfo } from "@/types";

/** 万世流涌大典 */
export const metaData: WeaponDetailInfo = {
	desc: "曾在水下的隐修会中代代流传的教谕书，如今已经无人知晓其存在。",
	attr: {
		atk: new Map([
			["1", 44.34],
			["20", 110.17],
			["40", 209.82],
			["50", 275.46],
			["60", 341.46],
			["70", 407.81],
			["80", 474.55],
			["90", 541.83],
			["20+", 141.27],
			["40+", 240.92],
			["50+", 306.66],
			["60+", 372.56],
			["70+", 438.91],
			["80+", 505.65]
		]),
		bonusKey: AttrKeys.cdmg,
		bonusData: new Map([
			["1", 19.2],
			["20", 33.93],
			["40", 49.44],
			["50", 57.2],
			["60", 64.95],
			["70", 72.69],
			["80", 80.45],
			["90", 88.2],
			["20+", 33.93],
			["40+", 49.44],
			["50+", 57.2],
			["60+", 64.95],
			["70+", 72.69],
			["80+", 80.45]
		])
	},
	materials: {
		[MaterialType.weapon]: "纯圣露滴的真粹",
		[MaterialType.monster]: "异界生命核",
		[MaterialType.normal]: "奇械机芯齿轮"
	},
	affixData: {
		title: "万世的浪涛",
		desc: "生命值提升$[0]。当前生命值提升或降低时，重击造成的伤害提升$[1]。该效果持续4秒，至多叠加3次，每0.3秒至多触发一次；叠加至3层或3层的持续时间刷新时，恢复$[2]点元素能量，每12秒至多通过这种方式恢复一次元素能量。",
		datas: {
			"0": [
				"16%",
				"20%",
				"24%",
				"28%",
				"32%"
			],
		"1": [
				"14%",
				"18%",
				"22%",
				"26%",
				"30%"
			],
		"2": [
				"8",
				"9",
				"10",
				"11",
				"12"
			]
		}
	}
}